// Перепишіть функцію, використовуючи '?' або '||'
// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm("Батьки дозволили?");
//   }
// }

// ---2---
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.

// const min = (a, b) => {
//   if (a > b) {
//     return a;
//   } else if (a < b) {
//     return b;
//   } else {
//     return console.log("Рівні значення");
//   }
// };

// ---3---
// Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:
// const ask = (question, yes, no) => {
//   if (confirm(question)) yes();
//   else no();
// };
// ask(
//   "Ви згодні?",
//   () => {
//     alert("Ви погодились.");
//   },
//   () => {
//     alert("Ви скасували виконання.");
//   }
// );
